# 1) რომელ ბიბლიოთეკას ვიყენებთ პითონში გეომეტრიული ფიგურების ასაგებად?
# from turtle import *

# 2)რომელ ფუნქციას ვიყენეთ როდესაც გვინდა რომ ტერმინალში მოვახვდინოტ დაბეჭვდა?
# print()

# 3)პითონის გამოყენებით შეუძლებელია ალგორითმის შექმნა
# False

# 4)ათწილადებზე სამუშაოდ რომელ მონაცემთა ტიპს ვიყენებთ?
# float

# 5) რომელია პიტონისთვის სწორი კომენტარი?
               #

# 6)რომელ ფუნქციას ვიყენებთ მომხმარებლისგან ტერმინალიდან ტექსტის მისაღებად?
# input()

# 7)ინფუთიდან მიღებული ინფორმაცია ინახება სტრინგის სახით
# True

# 8)როგორ ვამოწმებთ მონაცემთა ტიპს?
# type() 

# 9)რომელი ცვლადი ინახავს ათწილადს?
# x = 10/2  ათწილად გაყოფის შემდეგ მიიღება

# 10) პითონის ცვლადი სწორად შექმნილი?
# x = 12  პიტონში ცვლადი ასე ვწერთ

# 11)რას გამოიტანს კოდი?
name = "goal" 
surname = "oriented"
age = 100 
print(name + surname + age )

#error რადგან ინტეგერს სტრინგს ვერ მიუმატებ

# 12)რას გამოიტანს კოდი?
num1 = 10
num2 = 20
print (str(num1) + str(num2))

#1020 რადგან სტრინგებია და ერთმანეთს არ მიემატება

# 13)რას გამოიტანს კოდი როდესაც მოხმარებელი შემოიტანს 7-ს?
num1 = float(input("enter your number:  "))
print(type(num1 ))

#<class'float'> რაგდან ინფუტთან დავუწერეთ float 7 გახდება 7.0 type შემდეგ გვეუბნება თუ რა ტიპის რიცხვია(int, float or str)

# 14)პასუხი:
x = ((True and False) or (False or False))
y = ((False or True) and (False and True))
print((x and y) or True)

#true რადგან or არის true-ს ძმაკაცი

# 15)რას გამოიტანს კოდი როდესაც მომხმარებელი შეიყვანს 20-ს 
age = int(input("enter your age:  "))
print(age > 18)

#true რადგან 20 მეტია 18 ზე 